f1RearWingDynamic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  F1 Rear Wing - blockMeshDict (background domain for snappyHexMesh)
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Wing chord c = 0.25 m. Domain sized in multiples of chord.
// Origin (0 0 0) placed at wing leading edge / ground level - adjust to match your STL.

convertToMeters 1;

// Domain bounds
// x: -1.25 (5c upstream) to 3.75 (15c downstream)
// y: -2.0 to 2.0 (4m width, >4x span for low blockage)
// z: 0 (ground) to 2.5 (height)

vertices
(
    (-1.25 -2.0 0.0)   // 0
    ( 3.75 -2.0 0.0)   // 1
    ( 3.75  2.0 0.0)   // 2
    (-1.25  2.0 0.0)   // 3
    (-1.25 -2.0 2.5)   // 4
    ( 3.75 -2.0 2.5)   // 5
    ( 3.75  2.0 2.5)   // 6
    (-1.25  2.0 2.5)   // 7
);

// Background cell size ~ 60mm -> cell counts below
// x length 5.0m / 0.06 ~ 84, y length 4.0m / 0.06 ~ 67, z length 2.5/0.06 ~ 42
blocks
(
    hex (0 1 2 3 4 5 6 7) (84 67 42) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    ground
    {
        type wall;
        faces ((0 1 2 3));
    }
    top
    {
        type symmetry;
        faces ((4 5 6 7));
    }
    side1
    {
        type symmetry;
        faces ((0 1 5 4));
    }
    side2
    {
        type symmetry;
        faces ((3 7 6 2));
    }
);

mergePatchPairs
(
);
