f1RearWingDynamic/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  F1 Rear Wing - transportProperties
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;

// kinematic viscosity of air at 20C, 1 atm
nu              [0 2 -1 0 0 0 0] 1.5e-05;
