f1RearWingDynamic/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  F1 Rear Wing - p (kinematic pressure, incompressible)
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    ground
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetry;
    }

    side1
    {
        type            symmetry;
    }

    side2
    {
        type            symmetry;
    }

    mainplane
    {
        type            zeroGradient;
    }

    endplate
    {
        type            zeroGradient;
    }

    flap
    {
        type            zeroGradient;
    }

    AMI_inner
    {
        type            cyclicAMI;
    }

    AMI_outer
    {
        type            cyclicAMI;
    }
}
