f1RearWingDynamic/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  F1 Rear Wing - nut (turbulent viscosity)
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    ground
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    top
    {
        type            symmetry;
    }

    side1
    {
        type            symmetry;
    }

    side2
    {
        type            symmetry;
    }

    mainplane
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    endplate
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    flap
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    AMI_inner
    {
        type            cyclicAMI;
    }

    AMI_outer
    {
        type            cyclicAMI;
    }
}
