f1RearWingDynamic/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  F1 Rear Wing - fvSolution
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.05;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }

    "(U|k|omega|nuTilda)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    3;     // bumped from 2: moving mesh cases need tighter
                               // outer-loop convergence per timestep for stability
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;

    moveMeshOuterCorrectors true;   // re-solve mesh motion within outer correctors

    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        U
        {
            tolerance   1e-5;
            relTol      0;
        }
        p
        {
            tolerance   1e-4;
            relTol      0;
        }
    }
}

relaxationFactors
{
    // mild under-relaxation only on outer correctors, not used much in transient
    equations
    {
        ".*"            1;
    }
}
