f1RearWingDynamic/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  F1 Rear Wing - surfaceFeatureExtractDict
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

wing.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   150;
    }

    writeObj            yes;
}
